print("Решение через dict")
dict_month = {1: "Январь", 2: "Февраль", 3: "Март", 4: "Апрель", 5: "Май", 6: "Июнь",
              7: "Июль", 8: "Август", 9: "Сентябрь", 10: "Октябрь", 11: "Ноябрь", 12: "Декабрь"}
seasons = {"Зима": (1, 2, 12), "Весна": (3, 4, 5), "Лето": (6, 7, 8), "Осень": (9, 10, 11)}
user_month = int(input("Введите число месяца, НАПОМИНАЮ, у нас 12 месяцев: "))
for key in seasons.keys():
    if user_month in seasons[key]:
        season = key
print(f"Вы запросили месяц: {dict_month[user_month]}, время сезона - {season}.")

print("*" * 50)

print("Теперь решение через list")
dict_month = [[1, "Январь"], [2, "Февраль"], [3, "Март"], [4, "Апрель"], [5, "Май"], [6, "Июнь"],
              [7, "Июль"], [8, "Август"], [9, "Сентябрь"], [10, "Октябрь"], [11, "Ноябрь"], [12, "Декабрь"]]
seasons = [("Зима", 1, 2, 12), ("Весна", 3, 4, 5), ("Лето", 6, 7, 8), ("Осень", 9, 10, 11)]
user_month = int(input("Введите число месяца: "))
for i in dict_month:
    if user_month in i:
        month = i[1]
for i in seasons:
    if user_month in i:
        season = i[0]
print(f"Вы запросили месяц: {month}, время сезона - {season}.")